pavkriz/knxduino/hardware/knxduino/stm32/boards.txt
menu.pnum=Board variant

menu.xserial=U(S)ART support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

knxduino.name=KNXduino

knxduino.build.vid=0x0483
knxduino.build.core=STM32:arduino
knxduino.build.board=knxduino

# NUCLEO_F303RE board
# enable Comparator HAL module, provide custom LD script compatible with knxduino bootloader

knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL=KNXduino Nucleo F303RE with 32kB bootloader
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.node=KNXDUINO_NODE_F303RE_BL
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.upload.maximum_size=491520
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.upload.maximum_data_size=65536
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.board=KNXDUINO_NUCLEO_F303RE_BL
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.series=STM32F3xx
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.product_line=STM32F303xE
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.variant=KNXDUINO_NUCLEO_F303RE_BL
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.cmsis_lib_gcc=arm_cortexM4l_math
knxduino.menu.pnum.knxduino_NUCLEO_F303RE_BL.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DHAL_COMP_MODULE_ENABLED -DVECT_TAB_OFFSET=0x8000

knxduino.menu.pnum.knxduino_NUCLEO_F303RE=KNXduino Nucleo F303RE without bootloader
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.node=KNXDUINO_NODE_F303RE
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.upload.maximum_size=491520
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.upload.maximum_data_size=65536
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.board=KNXDUINO_NUCLEO_F303RE
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.series=STM32F3xx
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.product_line=STM32F303xE
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.variant=KNXDUINO_NUCLEO_F303RE
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math
knxduino.menu.pnum.knxduino_NUCLEO_F303RE.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DHAL_COMP_MODULE_ENABLED

# KNXDUINO ONE STM32G071 board

knxduino.menu.pnum.knxduino_ONE=KNXduino One without bootloader
knxduino.menu.pnum.knxduino_ONE.node=KNXDUINO_NODE_ONE
knxduino.menu.pnum.knxduino_ONE.upload.maximum_size=131072
knxduino.menu.pnum.knxduino_ONE.upload.maximum_data_size=32768
knxduino.menu.pnum.knxduino_ONE.build.mcu=cortex-m0plus
knxduino.menu.pnum.knxduino_ONE.build.board=KNXDUINO_ONE
knxduino.menu.pnum.knxduino_ONE.build.series=STM32G0xx
knxduino.menu.pnum.knxduino_ONE.build.product_line=STM32G071xx
knxduino.menu.pnum.knxduino_ONE.build.variant=KNXDUINO_ONE
knxduino.menu.pnum.knxduino_ONE.build.cmsis_lib_gcc=arm_cortexM0l_math
knxduino.menu.pnum.knxduino_ONE.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DHAL_COMP_MODULE_ENABLED -D__CORTEX_SC=0

knxduino.menu.pnum.knxduino_ONE_BL=KNXduino One with bootloader
knxduino.menu.pnum.knxduino_ONE_BL.node=KNXDUINO_NODE_ONE_BL
knxduino.menu.pnum.knxduino_ONE_BL.upload.maximum_size=131072
knxduino.menu.pnum.knxduino_ONE_BL.upload.maximum_data_size=32768
knxduino.menu.pnum.knxduino_ONE_BL.build.mcu=cortex-m0plus
knxduino.menu.pnum.knxduino_ONE_BL.build.board=KNXDUINO_ONE_BL
knxduino.menu.pnum.knxduino_ONE_BL.build.series=STM32G0xx
knxduino.menu.pnum.knxduino_ONE_BL.build.product_line=STM32G071xx
knxduino.menu.pnum.knxduino_ONE_BL.build.variant=KNXDUINO_ONE_BL
knxduino.menu.pnum.knxduino_ONE_BL.build.cmsis_lib_gcc=arm_cortexM0l_math
knxduino.menu.pnum.knxduino_ONE_BL.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DHAL_COMP_MODULE_ENABLED -D__CORTEX_SC=0 -DVECT_TAB_OFFSET=0x8000

knxduino.menu.opt.notset=Undefined (default)
knxduino.menu.opt.osstd=Smallest (-Os)
knxduino.menu.opt.osstd.build.flags.optimize=-Os
knxduino.menu.opt.oslto=Smallest (-Os) with LTO
knxduino.menu.opt.oslto.build.flags.optimize=-Os -flto
knxduino.menu.opt.o1std=Fast (-O1)
knxduino.menu.opt.o1std.build.flags.optimize=-O1
knxduino.menu.opt.o1lto=Fast (-O1) with LTO
knxduino.menu.opt.o1lto.build.flags.optimize=-O1 -flto
knxduino.menu.opt.o2std=Faster (-O2)
knxduino.menu.opt.o2std.build.flags.optimize=-O2
knxduino.menu.opt.o2lto=Faster (-O2) with LTO
knxduino.menu.opt.o2lto.build.flags.optimize=-O2 -flto
knxduino.menu.opt.o3std=Fastest (-O3)
knxduino.menu.opt.o3std.build.flags.optimize=-O3
knxduino.menu.opt.o3lto=Fastest (-O3) with LTO
knxduino.menu.opt.o3lto.build.flags.optimize=-O3 -flto
knxduino.menu.opt.ogstd=Debug (-g)
knxduino.menu.opt.ogstd.build.flags.optimize=-g -Og

knxduino.menu.upload_method.STLink=STLink
knxduino.menu.upload_method.STLink.upload.protocol=STLink
knxduino.menu.upload_method.STLink.upload.tool=stlink_upload

knxduino.menu.xserial.generic=Enabled (generic 'Serial')
knxduino.menu.xserial.none=Enabled (no generic 'Serial')
knxduino.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
knxduino.menu.xserial.disabled=Disabled (no Serial support)
knxduino.menu.xserial.disabled.build.xSerial=